app/views/aukcjes/_form.html.erb

            <div class="controls">
              <%= f.collection_select :kategorie_id, Kategorie.all, :id, :nazwa_kategorii, {prompt: "Wybierz", id:"kategorie_select"}, {class:"form-control"} %>
---
SELECT "kategories".* FROM "kategories"