app/views/searches/show.html.erb

SELECT "aukcjes".* FROM "aukcjes" WHERE (nazwa LIKE '%Aston%')
SELECT COUNT(*) FROM "aukcjes" WHERE (kategorie LIKE '%#<Kategorie:0x007f88d6cd0fd0>%')
---

<% if @search.search_aukcjes.empty? %>