app/controllers/aukcjes_controller.rb

SELECT "kategories".* FROM "kategories"
SELECT "aukcjes".* FROM "aukcjes" WHERE (nazwa LIKE '%%')
---
  def index
    @kategorie = Kategorie.all
    @aukcje = Aukcje.search((params[:q].present? ? params[:q] : '*')).records

SELECT "kategories".* FROM "kategories"
---
  def new
    @aukcje = Aukcje.new
    @kategorie = Kategorie.all

SELECT "kategories".* FROM "kategories"
SELECT  "aukcjes".* FROM "aukcjes" WHERE "aukcjes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @kategorie = Kategorie.all
    @aukcje = Aukcje.find(params[:id])

DELETE FROM "aukcjes" WHERE "aukcjes"."id" = $1  [["id", 1]]
---
  def destroy
   @aukcje.destroy

SELECT "aukcjes".* FROM "aukcjes"
---
 def licytacje
    @aukcje = Aukcje.all

INSERT INTO "aukcjes" ("nazwa", "opis", "cena_minimalna", "cena_aktualna", "koszt_przesylki", "data_zakonczenia", "created_at", "updated_at", "kategorie_id", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
      @aukcje = Aukcje.new(aukcje_params)

      respond_to do |format|
        if @aukcje.save

UPDATE "aukcjes" SET "data_zakonczenia" = $1, "updated_at" = $2 WHERE "aukcjes"."id" = $3  [["data_zakonczenia", Tue, 14 Mar 2017], ["updated_at", 2017-03-12 18:55:53 UTC], ["id", 2]]
---
    def update
    respond_to do |format|
      if @aukcje.update(aukcje_params.except(:user_id))

SELECT  "aukcjes".* FROM "aukcjes" WHERE "aukcjes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def set_aukcja
      @aukcje = Aukcje.find(params[:id])