app/controllers/home_controller.rb

SELECT "kategories".* FROM "kategories"
SELECT "users".* FROM "users"
SELECT "admins".* FROM "admins"
SELECT  "aukcjes".* FROM "aukcjes" ORDER BY "aukcjes"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
SELECT COUNT(*) FROM "aukcjes"
---
  def index
    @kategorie = Kategorie.all
    @user = User.all
    @admin = Admin.all
    @aukcje = Aukcje.offset(rand(Aukcje.count)).first

SELECT "kategories".* FROM "kategories"
---
  def panel_administratora
    @kategorie = Kategorie.all

SELECT "kategories".* FROM "kategories"
---
  def panel_uzytkownika
    @kategorie = Kategorie.all

SELECT "users".* FROM "users" ORDER BY created_at
---
  def uzytkownicy
    @kategorie = Kategorie.all
    @user = User.all

SELECT "admins".* FROM "admins" ORDER BY created_at
---
  def administratorzy
    @kategorie = Kategorie.all
    @admin = Admin.all