app/controllers/kategories_controller.rb

SELECT "kategories".* FROM "kategories"
---
 def index
   @kategorie = Kategorie.all

SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def show
   @aukcje = Aukcje.all.order('created_at DESC')
   @kategorie = Kategorie.find(params[:id])

DELETE FROM "kategories" WHERE "kategories"."id" = $1  [["id", 1]]
---
 def destroy
  @kategorie.destroy

INSERT INTO "kategories" ("nazwa_kategorii", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nazwa_kategorii", "Samochody"], ["created_at", 2017-03-07 19:06:06 UTC], ["updated_at", 2017-03-07 19:06:06 UTC], ["parent_id", 2]]
---
 def create
     @kategorie = Kategorie.new(kategorie_params)

     respond_to do |format|
       if @kategorie.save

UPDATE "kategories" SET "nazwa_kategorii" = $1, "updated_at" = $2 WHERE "kategories"."id" = $3  [["nazwa_kategorii", "Moda1"], ["updated_at", 2017-01-31 18:32:08 UTC], ["id", 4]]
---
   def update
   respond_to do |format|
     if @kategorie.update(kategorie_params.except(:user_id))

SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
     def set_kategoria
     @kategorie = Kategorie.find(params[:id])