app/controllers/searches_controller.rb

  def new
    @search = Search.new
    @kategorie = Kategorie.all
    @aukcje = Aukcje.search((params[:q].present? ? params[:q] : '*')).records
---
SELECT "kategories".* FROM "kategories"
SELECT "aukcjes".* FROM "aukcjes" WHERE 1=0

  def create
    @search = Search.create(search_params)
---
INSERT INTO "searches" ("klucz", "max_cena", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["klucz", ""], ["max_cena", #<BigDecimal:7f88d41a4870,'0.1E13',9(27)>], ["created_at", 2017-03-21 12:29:52 UTC], ["updated_at", 2017-03-21 12:29:52 UTC]]