app/views/kategories/_form.html.erb

SELECT "kategories"."id", "kategories"."nazwa_kategorii" FROM "kategories"
---
            <div class="controls">
               <%= f.select :parent_id, options_for_select(Kategorie.where.not(id: @kategorie.id).pluck(:id, :nazwa_kategorii).map{|db_fields| db_fields.join(' ')}),  { :include_blank => true },  class: "form-control" %>